rurban/qemu-stm32/hw/arm/stm32/stm32fxxx_rcc.c
/*
 * STM32 Microcontroller RCC (Reset and Clock Control) module
 *
 * Copyright (C) 2010 Andre Beckus
 * Copyright (c) 2018 Martin Schröder <mkschreder.uk@gmail.com>
 *
 * Source code based on omap_clk.c
 * Implementation based on ST Microelectronics "RM0008 Reference Manual Rev 10"
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License as
 * published by the Free Software Foundation; either version 2 of
 * the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program; if not, see <http://www.gnu.org/licenses/>.
 */

#include "qemu/osdep.h"
#include "qapi/error.h"
#include "qemu-common.h"
#include "cpu.h"

#include "qemu/timer.h"
#include <stdio.h>

#include "hw/sysbus.h"
#include "stm32fxxx_clktree.h"
#include "stm32fxxx_rcc.h"
#include "qemu/log.h"
#include "hw/arm/arm.h"

/* DEFINITIONS*/

/* See README for DEBUG details. */
#define DEBUG_STM32_RCC

#ifdef DEBUG_STM32_RCC
#define DPRINTF(fmt, ...)                                       \
do { printf("STM32F2XX_RCC: " fmt , ## __VA_ARGS__); } while (0)
#else
#define DPRINTF(fmt, ...)
#endif

#define IS_RESET_VALUE(new_value, mask, reset_value) ((new_value & mask) == (mask & reset_value))

#define WARN_UNIMPLEMENTED(new_value, mask, reset_value) \
    if (!IS_RESET_VALUE(new_value, mask, reset_value)) { \
        qemu_log_mask(LOG_UNIMP, "Not implemented: RCC " #mask ". Masked value: 0x%08x\n", (new_value & mask)); \
    }

#define WARN_UNIMPLEMENTED_REG(offset) \
        qemu_log_mask(LOG_UNIMP, "STM32f1xx_rcc: unimplemented register: 0x%x", (int)offset)

#define HSI_FREQ 16000000
#define LSI_FREQ 32000

#define RCC_CR_RESET_VALUE      0x00000083
#define RCC_CR_OFFSET           0x00
#define RCC_CR_PLLI2SRDY_BIT    27
#define RCC_CR_PLLI2SON_BIT     26
#define RCC_CR_PLLRDY_BIT       25
#define RCC_CR_PLLON_BIT        24
#define RCC_CR_CSSON_BIT        19
#define RCC_CR_HSEBYP_BIT       18
#define RCC_CR_HSERDY_BIT       17
#define RCC_CR_HSEON_BIT        16
#define RCC_CR_HSICAL_START     8
#define RCC_CR_HSICAL_MASK      0x0000ff00
#define RCC_CR_HSITRIM_START    3
#define RCC_CR_HSITRIM_MASK     0x000000f8
#define RCC_CR_HSIRDY_BIT       1
#define RCC_CR_HSION_BIT        0

#define RCC_PLLCFGR_RESET_VALUE  0x24003010
#define RCC_PLLCFGR_OFFSET       0x04
#define RCC_PLLCFGR_PLLQ_MASK    0x0F000000
#define RCC_PLLCFGR_PLLQ_START   24
#define RCC_PLLCFGR_PLLSRC_BIT   22
#define RCC_PLLCFGR_PLLP_MASK    0x00030000
#define RCC_PLLCFGR_PLLP_START   16
#define RCC_PLLCFGR_PLLN_MASK    0x00007FC0
#define RCC_PLLCFGR_PLLN_START   6
#define RCC_PLLCFGR_PLLM_MASK    0x0000003F
#define RCC_PLLCFGR_PLLM_START   0

#define RCC_CFGR_RESET_VALUE     0x00000000
#define RCC_CFGR_OFFSET          0x08
#define RCC_CFGR_MCO2_START      30
#define RCC_CFGR_MCO2_MASK       0xC0000000
#define RCC_CFGR_MCO2PRE_START   27
#define RCC_CFGR_MCO2PRE_MASK    0x38000000
#define RCC_CFGR_MCO1PRE_START   24
#define RCC_CFGR_MCO1PRE_MASK    0x07000000
#define RCC_CFGR_I2CSRC_BIT      23
#define RCC_CFGR_MCO1_START      21
#define RCC_CFGR_MCO1_MASK       0x00600000
#define RCC_CFGR_RTCPRE_START    16
#define RCC_CFGR_RTCPRE_MASK     0x001F0000
#define RCC_CFGR_PPRE2_START     13
#define RCC_CFGR_PPRE2_MASK      0x0000E000
#define RCC_CFGR_PPRE1_START     10
#define RCC_CFGR_PPRE1_MASK      0x00001C00
#define RCC_CFGR_HPRE_START      4
#define RCC_CFGR_HPRE_MASK       0x000000F0
#define RCC_CFGR_SWS_START       2
#define RCC_CFGR_SWS_MASK        0x0000000C
#define RCC_CFGR_SW_START        0
#define RCC_CFGR_SW_MASK         0x00000003

#define RCC_CIR_RESET_VALUE      0x00000000
#define RCC_CIR_OFFSET           0x0C
#define RCC_CIR_CSSC_BIT         23
#define RCC_CIR_PLLI2SRDYC_BIT   21
#define RCC_CIR_PLLRDYC_BIT      20
#define RCC_CIR_HSERDYC_BIT      19
#define RCC_CIR_HSIRDYC_BIT      18
#define RCC_CIR_LSERDYC_BIT      17
#define RCC_CIR_LSIRDYC_BIT      16
#define RCC_CIR_PLLI2SRDYIE_BIT  13
#define RCC_CIR_PLLRDYIE_BIT     12
#define RCC_CIR_HSERDYIE_BIT     11
#define RCC_CIR_HSIRDYIE_BIT     10
#define RCC_CIR_LSERDYIE_BIT     9
#define RCC_CIR_LSIRDYIE_BIT     8
#define RCC_CIR_CSSF_BIT         7
#define RCC_CIR_PLLI2SRDYF_BIT  5
#define RCC_CIR_PLLRDYF_BIT     4
#define RCC_CIR_HSERDYF_BIT     3
#define RCC_CIR_HSIRDYF_BIT     2
#define RCC_CIR_LSERDYF_BIT     1
#define RCC_CIR_LSIRDYF_BIT     0

#define RCC_AHB1RSTR_OFFSET 0x10

#define RCC_AHB2RSTR_OFFSET 0x14

#define RCC_AHB3RSTR_OFFSET 0x18

#define RCC_APB1RSTR_OFFSET 0x20

#define RCC_APB2RSTR_RESET_VALUE     0x00000000
#define RCC_APB2RSTR_OFFSET          0x24
#define RCC_APB2RSTR_TIM11RST_BIT    18
#define RCC_APB2RSTR_TIM10RST_BIT    17
#define RCC_APB2RSTR_TIM9RST_BIT     16
#define RCC_APB2RSTR_SYSCFGRST       14
#define RCC_APB2RSTR_SPI1_BIT        12
#define RCC_APB2RSTR_SDIORST_BIT     11
#define RCC_APB2RSTR_ADCRST_BIT      8
#define RCC_APB2RSTR_USART6RST       5
#define RCC_APB2RSTR_USART1RST       4
#define RCC_APB2RSTR_TIM8RST_BIT     1
#define RCC_APB2RSTR_TIM1RST_BIT     0

#define RCC_AHB1ENR_RESET_VALUE      0x00000000
#define RCC_AHB1ENR_OFFSET           0x30
#define RCC_AHB1ENR_OTGHSULPIEN_BIT  30
#define RCC_AHB1ENR_OTGHSEN_BIT      29
#define RCC_AHB1ENR_ETHMACPTPEN_BIT  28
#define RCC_AHB1ENR_ETHMACRXEN_BIT   27
#define RCC_AHB1ENR_ETHMACTXEN_BIT   26
#define RCC_AHB1ENR_ETHMACEN_BIT     25
#define RCC_AHB1ENR_DMA2EN_BIT       22
#define RCC_AHB1ENR_DMA1EN_BIT       21
#define RCC_AHB1ENR_BKPSRAMEN_BIT    18
#define RCC_AHB1ENR_CRCEN_BIT        12
#define RCC_AHB1ENR_GPIOKEN_BIT      10
#define RCC_AHB1ENR_GPIOJEN_BIT      9
#define RCC_AHB1ENR_GPIOIEN_BIT      8
#define RCC_AHB1ENR_GPIOHEN_BIT      7
#define RCC_AHB1ENR_GPIOGEN_BIT      6
#define RCC_AHB1ENR_GPIOFEN_BIT      5
#define RCC_AHB1ENR_GPIOEEN_BIT      4
#define RCC_AHB1ENR_GPIODEN_BIT      3
#define RCC_AHB1ENR_GPIOCEN_BIT      2
#define RCC_AHB1ENR_GPIOBEN_BIT      1
#define RCC_AHB1ENR_GPIOAEN_BIT      0

#define RCC_AHB2ENR_OFFSET 0x34
#define RCC_AHB2ENR_DCMIEN_BIT       0
#define RCC_AHB2ENR_CRYPEN_BIT       4
#define RCC_AHB2ENR_HASHEN_BIT       5
#define RCC_AHB2ENR_RNGEN_BIT        6
#define RCC_AHB2ENR_OTGFSEN_BIT      7

#define RCC_AHB3ENR_OFFSET 0x38
#define RCC_AHB3ENR_FSMCEN_BIT       0

#define RCC_APB1ENR_RESET_VALUE  0x00000000
#define RCC_APB1ENR_OFFSET       0x40
#define RCC_APB1ENR_USART8EN_BIT 31
#define RCC_APB1ENR_USART7EN_BIT 30
#define RCC_APB1ENR_DACEN_BIT    29
#define RCC_APB1ENR_PWREN_BIT    28
#define RCC_APB1ENR_BKPEN_BIT    27
#define RCC_APB1ENR_CAN2EN_BIT   26
#define RCC_APB1ENR_CAN1EN_BIT   25
#define RCC_APB1ENR_CANEN_BIT    25
#define RCC_APB1ENR_USBEN_BIT    23
#define RCC_APB1ENR_I2C2EN_BIT   22
#define RCC_APB1ENR_I2C1EN_BIT   21
#define RCC_APB1ENR_USART5EN_BIT 20
#define RCC_APB1ENR_USART4EN_BIT 19
#define RCC_APB1ENR_USART3EN_BIT 18
#define RCC_APB1ENR_USART2EN_BIT 17
#define RCC_APB1ENR_SPI3EN_BIT   15
#define RCC_APB1ENR_SPI2EN_BIT   14
#define RCC_APB1ENR_WWDGEN_BIT   11
#define RCC_APB1ENR_TIM7EN_BIT   5
#define RCC_APB1ENR_TIM6EN_BIT   4
#define RCC_APB1ENR_TIM5EN_BIT   3
#define RCC_APB1ENR_TIM4EN_BIT   2
#define RCC_APB1ENR_TIM3EN_BIT   1
#define RCC_APB1ENR_TIM2EN_BIT   0

#define RCC_APB2ENR_RESET_VALUE  0x00000000
#define RCC_APB2ENR_OFFSET       0x44
#define RCC_APB2ENR_MASK         0x00075F33
#define RCC_APB2ENR_TIM11EN      18
#define RCC_APB2ENR_TIM10EN      17
#define RCC_APB2ENR_TIM9EN       16
#define RCC_APB2ENR_SYSCFGEN_BIT 14
#define RCC_APB2ENR_SPI1EN_BIT   12
#define RCC_APB2ENR_SDIOEN_BIT   11
#define RCC_APB2ENR_ADC3EN_BIT   10
#define RCC_APB2ENR_ADC2EN_BIT   9
#define RCC_APB2ENR_ADC1EN_BIT   8
#define RCC_APB2ENR_USART6EN_BIT 5
#define RCC_APB2ENR_USART1EN_BIT 4
#define RCC_APB2ENR_TIM8EN_BIT   1
#define RCC_APB2ENR_TIM1EN_BIT   0

#define RCC_AHB1LPENR_RESET_VALUE  0x7E6791FF
#define RCC_AHB1LPENR_OFFSET       0x50

#define RCC_AHB2LPENR_RESET_VALUE  0x000000F1
#define RCC_AHB2LPENR_OFFSET       0x54

#define RCC_AHB3LPENR_RESET_VALUE  0x00000001
#define RCC_AHB3LPENR_OFFSET       0x58

