rurban/qemu-stm32/hw/arm/stm32/stm32fxxx_rcc.c
    unsigned output_count;                                                      
    struct Clk *output[CLKTREE_MAX_OUTPUT];                                     
                                                                                
    unsigned input_count;                                                       
    int selected_input;                                                         
    struct Clk *input[CLKTREE_MAX_INPUT];                                       
};                                                                              
                                                                                

/* Enable the peripheral clock if the specified bit is set in the value. */
static void stm32_rcc_periph_enable(
                                    struct stm32f1xx_rcc *s,
                                    uint32_t new_value,
                                    bool init,
                                    int periph,
                                    uint32_t bit_mask)
{
    printf("rcc set 0x%x %s %d %x: %sable\n", new_value, s->PERIPHCLK[periph]->name, periph, bit_mask, (new_value & (1 << bit_mask))?"en":"dis");
    clktree_set_enabled(s->PERIPHCLK[periph], (new_value & (1 << bit_mask)) != 0);
}





/* REGISTER IMPLEMENTATION */

/* Read the configuration register.
   NOTE: Not implemented: CSS, PLLI2S, clock calibration and trimming. */
static uint32_t stm32_rcc_RCC_CR_read(struct stm32f1xx_rcc *s)
{
    /* Get the status of the clocks. */
    const bool PLLON = true; //clktree_is_enabled(s->PLLCLK);
    const bool HSEON = true; //clktree_is_enabled(s->HSECLK);
    const bool HSION = true; //clktree_is_enabled(s->HSICLK);
    const bool PLLI2SON = true; //clktree_is_enabled(s->PLLI2SCLK);

    /* build the register value based on the clock states.  If a clock is on,
     * then its ready bit is always set.
     */
    return (
        GET_BIT_MASK(RCC_CR_PLLRDY_BIT, PLLON) |
        GET_BIT_MASK(RCC_CR_PLLON_BIT, PLLON) |

        GET_BIT_MASK(RCC_CR_HSERDY_BIT, HSEON) |
        GET_BIT_MASK(RCC_CR_HSEON_BIT, HSEON) |

        GET_BIT_MASK(RCC_CR_HSIRDY_BIT, HSION) |
        GET_BIT_MASK(RCC_CR_HSION_BIT, HSION) |

        GET_BIT_MASK(RCC_CR_PLLI2SRDY_BIT, PLLI2SON) |
        GET_BIT_MASK(RCC_CR_PLLI2SON_BIT, PLLI2SON)
    );
}

/* Write the Configuration Register.
 * This updates the states of the corresponding clocks.  The bit values are not
 * saved - when the register is read, its value will be built using the clock
 * states.
 */
static void stm32_rcc_RCC_CR_write(struct stm32f1xx_rcc *s, uint32_t new_value, bool init)
{
    bool new_PLLON, new_HSEON, new_HSION, new_PLLI2SON;

    new_PLLON = IS_BIT_SET(new_value, RCC_CR_PLLON_BIT);
    if((clktree_is_enabled(s->PLLCLK) && !new_PLLON) &&
       s->RCC_CFGR_SW == SW_PLL_SELECTED) {
        printf("PLL cannot be disabled while it is selected as the system clock.");
    }
    clktree_set_enabled(s->PLLCLK, new_PLLON);

    new_HSEON = IS_BIT_SET(new_value, RCC_CR_HSEON_BIT);
    if((clktree_is_enabled(s->HSECLK) && !new_HSEON) &&
       (s->RCC_CFGR_SW == SW_HSE_SELECTED || s->RCC_CFGR_SW == SW_PLL_SELECTED)
       ) {
        printf("HSE oscillator cannot be disabled while it is driving the system clock.");
    }
    clktree_set_enabled(s->HSECLK, new_HSEON);

    new_HSION = IS_BIT_SET(new_value, RCC_CR_HSION_BIT);
    if((clktree_is_enabled(s->HSECLK) && !new_HSEON) &&
       (s->RCC_CFGR_SW == SW_HSI_SELECTED || s->RCC_CFGR_SW == SW_PLL_SELECTED)
       ) {
        printf("HSI oscillator cannot be disabled while it is driving the system clock.");
    }
    clktree_set_enabled(s->HSICLK, new_HSION);

    new_PLLI2SON = IS_BIT_SET(new_value, RCC_CR_PLLI2SON_BIT);
    clktree_set_enabled(s->PLLI2SCLK, new_PLLI2SON);

    WARN_UNIMPLEMENTED(new_value, 1 << RCC_CR_CSSON_BIT, RCC_CR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, RCC_CR_HSICAL_MASK, RCC_CR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, RCC_CR_HSITRIM_MASK, RCC_CR_RESET_VALUE);
}


static uint32_t stm32_rcc_RCC_PLLCFGR_read(struct stm32f1xx_rcc *s)
{
    return s->RCC_PLLCFGR;
}

static void stm32_rcc_RCC_PLLCFGR_write(struct stm32f1xx_rcc *s, uint32_t new_value, bool init)
{
    /* PLLM division factor */
    const uint8_t new_PLLM = (new_value & RCC_PLLCFGR_PLLM_MASK) >> RCC_PLLCFGR_PLLM_START;
    if (new_PLLM <= 1) {
        hw_error("PLLM division factor cannot be 0 or 1. Given: %u", new_PLLM);
    }

    /* PLLN multiplication factor */
    const uint16_t new_PLLN = (new_value & RCC_PLLCFGR_PLLN_MASK) >> RCC_PLLCFGR_PLLN_START;
    if (new_PLLN <= 1 || new_PLLN >= 433) {
        hw_error("PLLN multiplication factor must be between 2 and 432 (inclusive). Given: %u", new_PLLN);
    }

    /* PLLSRC */
    const uint8_t new_PLLSRC = IS_BIT_SET(new_value, RCC_PLLCFGR_PLLSRC_BIT);

    /* PPLP division factor */
    const uint8_t new_PLLP = 2 + (2 * ((new_value & RCC_PLLCFGR_PLLP_MASK) >> RCC_PLLCFGR_PLLP_START));

    /* Warn in case of illegal writes: */
    if (init == false) {
        const bool are_disabled = (!clktree_is_enabled(s->PLLCLK) /* && TODO: !clktree_is_enabled(s->PLLI2SCLK) */);
        if (are_disabled == false) {
            const char *warning_fmt = "Can only change %s while PLL and PLLI2S are disabled\n";
            if (new_PLLM != s->RCC_PLLCFGR_PLLM) {
                printf(warning_fmt, "PLLM");
            }
            if (new_PLLN != s->RCC_PLLCFGR_PLLN) {
                printf(warning_fmt, "PLLN");
            }
            if (new_PLLSRC != s->RCC_PLLCFGR_PLLSRC) {
                printf(warning_fmt, "PLLSRC");
            }
        }
    }

    /* Save new register value */
    s->RCC_PLLCFGR = new_value;

    /* Set the new values: */
    s->RCC_PLLCFGR_PLLM = new_PLLM;
    s->RCC_PLLCFGR_PLLN = new_PLLN;
    clktree_set_scale(s->PLLM, new_PLLN, new_PLLM);

    s->RCC_PLLCFGR_PLLSRC = new_PLLSRC;
    clktree_set_selected_input(s->PLLM, new_PLLSRC);

    s->RCC_PLLCFGR_PLLP = new_PLLP;
    clktree_set_scale(s->PLLCLK, 1, new_PLLP);

    WARN_UNIMPLEMENTED(new_value, RCC_PLLCFGR_PLLQ_MASK, RCC_PLLCFGR_RESET_VALUE);
}


static uint32_t stm32_rcc_RCC_PLLI2SCFGR_read(struct stm32f1xx_rcc *s)
{
    return s->RCC_PLLI2SCFGR;
}


static void stm32_rcc_RCC_PLLI2SCFGR_write(struct stm32f1xx_rcc *s, uint32_t new_value, bool init)
{
    /* PLLR division factor */
    const uint16_t new_PLLR = (new_value & RCC_PLLI2SCFGR_PLLR_MASK) >> RCC_PLLI2SCFGR_PLLR_START;
    if (new_PLLR < 2 || new_PLLR > 7) {
        hw_error("PLLR multiplication factor must be between 2 and 7. Given: %u", new_PLLR);
    }

    /* PLLQ division factor */
    const uint16_t new_PLLQ = (new_value & RCC_PLLI2SCFGR_PLLQ_MASK) >> RCC_PLLI2SCFGR_PLLQ_START;
    if (new_PLLQ > 15) {
        hw_error("PLLQ multiplication factor must be between 0 and 15 "
                 "(inclusive). Given: %u", new_PLLQ);
    }

    /* PLLN multiplication factor */
    const uint16_t new_PLLN = (new_value & RCC_PLLI2SCFGR_PLLN_MASK) >> RCC_PLLI2SCFGR_PLLN_START;
    if (new_PLLN < 2 || new_PLLN > 433) {
        hw_error("PLLN multiplication factor must be between 2 and 432 (inclusive). Given: %u", new_PLLN);
    }


