rurban/qemu-stm32/hw/arm/stm32/stm32fxxx_rcc.c
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_AHB1ENR_OTGHSULPIEN_BIT, RCC_AHB1ENR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_AHB1ENR_OTGHSEN_BIT, RCC_AHB1ENR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_AHB1ENR_ETHMACPTPEN_BIT, RCC_AHB1ENR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_AHB1ENR_ETHMACRXEN_BIT, RCC_AHB1ENR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_AHB1ENR_ETHMACTXEN_BIT, RCC_AHB1ENR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_AHB1ENR_ETHMACEN_BIT, RCC_AHB1ENR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_AHB1ENR_BKPSRAMEN_BIT, RCC_AHB1ENR_RESET_VALUE);
}

static void stm32_rcc_RCC_AHB2ENR_write(struct stm32f1xx_rcc *s, uint32_t new_value, bool init)
{
    clktree_set_enabled(s->PERIPHCLK[STM32_DCMI_PERIPH],
                        IS_BIT_SET(new_value, RCC_AHB2ENR_DCMIEN_BIT));
    clktree_set_enabled(s->PERIPHCLK[STM32_CRYP_PERIPH],
                        IS_BIT_SET(new_value, RCC_AHB2ENR_CRYPEN_BIT));
    clktree_set_enabled(s->PERIPHCLK[STM32_HASH_PERIPH],
                        IS_BIT_SET(new_value, RCC_AHB2ENR_HASHEN_BIT));
    clktree_set_enabled(s->PERIPHCLK[STM32_RNG_PERIPH],
                        IS_BIT_SET(new_value, RCC_AHB2ENR_RNGEN_BIT));
    s->RCC_AHB2ENR = new_value;
}

static void stm32_rcc_RCC_AHB3ENR_write(struct stm32f1xx_rcc *s, uint32_t new_value, bool init)
{
    clktree_set_enabled(s->PERIPHCLK[STM32_FSMC],
                        IS_BIT_SET(new_value, RCC_AHB3ENR_FSMCEN_BIT));
    s->RCC_AHB3ENR = new_value;
}

/* Write the APB2 peripheral clock enable register
 * Enables/Disables the peripheral clocks based on each bit. */
static void stm32_rcc_RCC_APB2ENR_write(struct stm32f1xx_rcc *s, uint32_t new_value,
                                        bool init)
{
    /* TODO: enable/disable missing peripherals */
    stm32_rcc_periph_enable(s, new_value, init, STM32_SYSCFG, RCC_APB2ENR_SYSCFGEN_BIT);
    stm32_rcc_periph_enable(s, new_value, init, STM32_UART1, RCC_APB2ENR_USART1EN_BIT);
    stm32_rcc_periph_enable(s, new_value, init, STM32_UART6, RCC_APB2ENR_USART6EN_BIT);

    s->RCC_APB2ENR = new_value & RCC_APB2ENR_MASK;
}

/* Write the APB1 peripheral clock enable register
 * Enables/Disables the peripheral clocks based on each bit. */
static void stm32_rcc_RCC_APB1ENR_write(struct stm32f1xx_rcc *s, uint32_t new_value,
                                        bool init)
{
    stm32_rcc_periph_enable(s, new_value, init, STM32_UART8,
                            RCC_APB1ENR_USART8EN_BIT);
    stm32_rcc_periph_enable(s, new_value, init, STM32_UART7,
                            RCC_APB1ENR_USART7EN_BIT);
    stm32_rcc_periph_enable(s, new_value, init, STM32_UART5,
                            RCC_APB1ENR_USART5EN_BIT);
    stm32_rcc_periph_enable(s, new_value, init, STM32_UART4,
                            RCC_APB1ENR_USART4EN_BIT);
    stm32_rcc_periph_enable(s, new_value, init, STM32_UART3,
                            RCC_APB1ENR_USART3EN_BIT);
    stm32_rcc_periph_enable(s, new_value, init, STM32_UART2,
                            RCC_APB1ENR_USART2EN_BIT);

    /* 0b00110110111111101100100111111111 */
    s->RCC_APB1ENR = new_value & 0x36fec9ff;
}

static uint32_t stm32_rcc_RCC_BDCR_read(struct stm32f1xx_rcc *s)
{
    bool lseon = clktree_is_enabled(s->LSECLK);

    return GET_BIT_MASK(RCC_BDCR_LSERDY_BIT, lseon) |
    GET_BIT_MASK(RCC_BDCR_LSEON_BIT, lseon) | 0x100; /* XXX force LSE */
}

static void stm32_rcc_RCC_BDCR_writeb0(struct stm32f1xx_rcc *s, uint8_t new_value, bool init)
{
    clktree_set_enabled(s->LSECLK, IS_BIT_SET(new_value, RCC_BDCR_LSEON_BIT));
    
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_BDCR_LSEBYP_BIT, RCC_BDCR_RESET_VALUE);
}

static void stm32_rcc_RCC_BDCR_write(struct stm32f1xx_rcc *s, uint32_t new_value, bool init)
{
    stm32_rcc_RCC_BDCR_writeb0(s, new_value & 0xff, init);

    WARN_UNIMPLEMENTED(new_value, 1 << RCC_BDCR_BDRST_BIT, RCC_BDCR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, 1 << RCC_BDCR_RTCEN_BIT, RCC_BDCR_RESET_VALUE);
    WARN_UNIMPLEMENTED(new_value, RCC_BDCR_RTCSEL_MASK, RCC_BDCR_RESET_VALUE);
}

/* Works the same way as stm32_rcc_RCC_CR_read */
static uint32_t stm32_rcc_RCC_CSR_read(struct stm32f1xx_rcc *s)
{
    bool lseon = clktree_is_enabled(s->LSICLK);

    return GET_BIT_MASK(RCC_CSR_LSIRDY_BIT, lseon) |
    GET_BIT_MASK(RCC_CSR_LSION_BIT, lseon);
}

/* Works the same way as stm32_rcc_RCC_CR_write */
static void stm32_rcc_RCC_CSR_write(struct stm32f1xx_rcc *s, uint32_t new_value, bool init)
{
    clktree_set_enabled(s->LSICLK, IS_BIT_SET(new_value, RCC_CSR_LSION_BIT));
}



static uint64_t stm32_rcc_readw(void *opaque, hwaddr offset)
{
    struct stm32f1xx_rcc *s = (struct stm32f1xx_rcc *)opaque;

    switch (offset) {
        case RCC_CR_OFFSET:
            return stm32_rcc_RCC_CR_read(s);
        case RCC_PLLCFGR_OFFSET:
            return stm32_rcc_RCC_PLLCFGR_read(s);
        case RCC_CFGR_OFFSET:
            return stm32_rcc_RCC_CFGR_read(s);
        case RCC_CIR_OFFSET:
            return stm32_rcc_RCC_CIR_read(s);
        case RCC_AHB1RSTR_OFFSET:
        case RCC_AHB2RSTR_OFFSET:
        case RCC_AHB3RSTR_OFFSET:
            WARN_UNIMPLEMENTED_REG(offset);
            return 0;
        case RCC_APB1RSTR_OFFSET:
            WARN_UNIMPLEMENTED_REG(offset);
            return 0;
        case RCC_APB2RSTR_OFFSET:
            WARN_UNIMPLEMENTED_REG(offset);
            return 0;
        case RCC_AHB1ENR_OFFSET:
            return stm32_rcc_RCC_AHB1ENR_read(s);
        case RCC_AHB2ENR_OFFSET:
            return stm32_rcc_RCC_AHB2ENR_read(s);
        case RCC_AHB3ENR_OFFSET:
            return stm32_rcc_RCC_AHB3ENR_read(s);
        case RCC_APB1ENR_OFFSET:
            return s->RCC_APB1ENR;
        case RCC_APB2ENR_OFFSET:
            return s->RCC_APB2ENR;
        case RCC_AHB1LPENR_OFFSET:
        case RCC_AHB2LPENR_OFFSET:
        case RCC_AHB3LPENR_OFFSET:
        case RCC_APB1LPENR_OFFSET:
        case RCC_APB2LPENR_OFFSET:
            WARN_UNIMPLEMENTED_REG(offset);
            return 0;
        case RCC_BDCR_OFFSET:
            return stm32_rcc_RCC_BDCR_read(s);
        case RCC_CSR_OFFSET:
            return stm32_rcc_RCC_CSR_read(s);
        case RCC_SSCGR_OFFSET:
            WARN_UNIMPLEMENTED_REG(offset);
            return 0;
        case RCC_PLLI2SCFGR_OFFSET:
            return stm32_rcc_RCC_PLLI2SCFGR_read(s);
        default:
            WARN_UNIMPLEMENTED_REG(offset);
            break;
    }
    return 0;
}

static void stm32_rcc_writew(void *opaque, hwaddr offset,
                             uint64_t value)
{
    struct stm32f1xx_rcc *s = (struct stm32f1xx_rcc *)opaque;

